var city_data1={"四川省":{"成都市":["锦江区","青羊区","金牛区","武侯区","成华区","龙泉驿区","青白江区","新都区","温江县","金堂县","双流县","郫县","大邑县","蒲江县","新津县","都江堰市","彭州市","邛崃市","崇州市"],"自贡市":["自流井区","贡井区","大安区","沿滩区","荣县","富顺县"],"攀枝花市":["东区","西区","仁和区","米易县","盐边县"],"泸州市":["江阳区","纳溪区","龙马潭区","泸县","合江县","叙永县","古蔺县"],"德阳市":["旌阳区","中江县","罗江县","广汉市","什邡市","绵竹市"],"绵阳市":["涪城区","游仙区","三台县","盐亭县","安县","梓潼县","北川羌族自治县","平武县","江油市"],"广元市":["市中区","元坝区","朝天区","旺苍县","青川县","剑阁县","苍溪县"],"遂宁市":["船山区","安居区","蓬溪县","射洪县","大英县"],"内江市":["市中区","东兴区","威远县","资中县","隆昌县"],"乐山市":["市中区","沙湾区","五通桥区","金口河区","犍为县","井研县","夹江县","沐川县","峨边彝族自治县","马边彝族自治县","峨眉山市"],"南充市":["顺庆区","高坪区","嘉陵区","南部县","营山县","蓬安县","仪陇县","西充县","阆中市"],"眉山市":["东坡区","仁寿县","彭山县","洪雅县","丹棱县","青神县"],"宜宾市":["翠屏区","宜宾县","南溪县","江安县","长宁县","高县","珙县","筠连县","兴文县","屏山县"],"广安市":["广安区","岳池县","武胜县","邻水县","华莹市"],"达州市":["通川区","达县","宣汉县","开江县","大竹县","渠县","万源市"],"雅安市":["雨城区","名山县","荥经县","汉源县","石棉县","天全县","芦山县","宝兴县"],"巴中市":["巴州区","通江县","南江县","平昌县"],"资阳市":["雁江区","安岳县","乐至县","简阳市"],"阿坝藏族羌族自治州":["汶川县","理县","茂县","松潘县","九寨沟县","金川县","小金县","黑水县","马尔康县","壤塘县","阿坝县","若尔盖县","红原县"],"甘孜藏族自治州":["康定县","泸定县","丹巴县","九龙县","雅江县","道孚县","炉霍县","甘孜县","新龙县","德格县","白玉县","石渠县","色达县","理塘县","巴塘县","乡城县","稻城县","得荣县"],"凉山彝族自治州":["西昌市","木里藏族自治县","盐源县","德昌县","会理县","会东县","宁南县","普格县","布拖县","金阳县","昭觉县","喜德县","冕宁县","越西县","甘洛县","美姑县","雷波县"]}};
var city_data2 = {
  "四川省": {
  
    "成都": [{
      "areaname": "不限1",
      "id": "510104"
    }, {
      "areaname": "不限2",
      "id": "510104"
      }, {
        "areaname": "不限3",
        "id": "510104"
    }, {
      "areaname": "不限4",
      "id": "510104"
    }],
    "绵阳": ["锦江区", "青羊区", "新都区", "温江县"]
  }
}
var city_data = {
  "区域": [{
    "id": "5101",
    "name": "不限",
    "list": [{
      "name": "不限",
      "id": "5101"
    }]
  },{
    "id": "510104",
    "name": "锦江区",
    "list": [{
      "name": "不限",
      "id": "510104"
    }, {
      "name": "川师",
      "id": "51010401"
    }, {
      "name": "东客站",
      "id": "51010402"
    }, {
      "name": "东大路",
      "id": "51010403"
    }, {
      "name": "东湖",
      "id": "51010404"
    }, {
      "name": "东光小区",
      "id": "51010405"
    }, {
      "name": "红星路",
      "id": "51010406"
    }, {
      "name": "合江亭",
      "id": "51010407"
    }, {
      "name": "九眼桥",
      "id": "51010408"
    }, {
      "name": "静居寺",
      "id": "51010409"
    }, {
      "name": "莲花",
      "id": "51010410"
    }, {
      "name": "莲谷地",
      "id": "51010411"
    }, {
      "name": "琉璃厂",
      "id": "51010412"
    }, {
      "name": "攀成钢",
      "id": "51010413"
    }, {
      "name": "水碾河",
      "id": "51010414"
    }, {
      "name": "三官堂",
      "id": "51010415"
    }, {
      "name": "沙河堡",
      "id": "51010416"
    }, {
      "name": "三圣乡",
      "id": "51010417"
    }, {
      "name": "盐市口",
      "id": "51010418"
    }, {
      "name": "卓锦城",
      "id": "51010419"
    }]
  }, {
      "id": "510105",
    "name": "青羊区",
    "list": [{
      "name": "不限",
      "id": "510105"
    }, {
      "name": "八宝街",
      "id": "51010501"
    }, {
      "name": "贝森",
      "id": "51010502"
    }, {
      "name": "草市街",
      "id": "51010503"
    }, {
      "name": "草堂",
      "id": "51010504"
    }, {
      "name": "府南新区",
      "id": "51010505"
    }, {
      "name": "光华泡小",
      "id": "51010506"
    }, {
      "name": "浣花溪",
      "id": "51010507"
    },
    {
      "name": "蛟龙港",
      "id": "51010508"
    }, {
      "name": "金沙",
      "id": "51010509"
    }, {
      "name": "宽窄巷子",
      "id": "51010510"
    }, {
      "name": "人民公园",
      "id": "51010511"
    }, {
      "name": "太升路",
      "id": "51010512"
    }, {
      "name": "外金沙",
      "id": "51010513"
    }, {
      "name": "万家湾",
      "id": "51010514"
    }, {
      "name": "外光华",
      "id": "51010515"
    }, {
      "name": "西南财大",
      "id": "51010516"
    }, {
      "name": "优品道",
      "id": "51010517"
    }]
    }, {
      "id": "510107",
      "name": "武侯区",
      "list": [{
        "name": "不限",
        "id": "510107"
      }, {
        "name": "川音",
        "id": "51010701"
      }, {
        "name": "草金立交",
        "id": "51010702"
      }, {
        "name": "簇桥",
        "id": "51010703"
      }, {
        "name": "川大",
        "id": "51010704"
      }, {
        "name": "广福桥",
        "id": "51010705"
      }, {
        "name": "高升桥",
        "id": "51010706"
      }, {
        "name": "航空港",
        "id": "51010707"
      }, {
        "name": "华西",
        "id": "51010708"
      }, {
        "name": "航空路",
        "id": "51010709"
      }, {
        "name": "火车南站",
        "id": "51010710"
      }, {
        "name": "红牌楼",
        "id": "51010711"
      }, {
        "name": "丽都",
        "id": "51010712"
      }, {
        "name": "龙湾",
        "id": "51010713"
      }, {
        "name": "双楠",
        "id": "51010714"
      }, {
        "name": "桐梓林",
        "id": "51010715"
      }, {
        "name": "武侯立交",
        "id": "51010716"
      }, {
        "name": "武侯祠",
        "id": "51010717"
      },, {
        "name": "外双楠",
        "id": "51010718"
      }, {
        "name": "五大花园",
        "id": "51010719"
      },{
        "name": "新双楠",
        "id": "51010720"
      }, {
        "name": "玉林",
        "id": "51010721"
      }, {
        "name": "棕北",
        "id": "51010722"
      }]
  }, {
    "id": "510125",
    "name": "高新区",
    "list": [{
      "name": "不限",
      "id": "510125"
    }, { "name": "城南宜家", "id": "51012501" }, { "name": "大源", "id": "51012502" }, { "name": "东苑", "id": "51012503" }, { "name": "芳草", "id": "51012504" }, { "name": "广都", "id": "51012505" }, { "name": "高朋", "id": "51012506" }, { "name": "华阳", "id": "51012507" }, { "name": "金融城", "id": "51012508" }, { "name": "琉璃场", "id": "51012509" }, { "name": "神仙树", "id": "51012510" }, { "name": "市一医院", "id": "51012511" }, { "name": "天府长城", "id": "51012512" }, { "name": "新北", "id": "51012513" }, { "name": "新会展", "id": "51012514" }, { "name": "衣冠庙", "id": "51012515" }, { "name": "远大", "id": "51012516" }, { "name": "中和", "id": "51012517" }, { "name": "紫荆", "id": "51012518" }, { "name": "中德", "id": "51012519" }]
    }, {
      "id": "510108",
      "name": "成华区",
      "list": [{
        "name": "不限",
        "id": "510108"
      }, { "name": "八里小区", "id": "51010801" }, { "name": "保利公园", "id": "51010802" }, { "name": "成渝立交", "id": "51010803" }, { "name": "东客站", "id": "51010804" }, { "name": "动物园", "id": "51010805" }, { "name": "东郊记忆", "id": "51010806" }, { "name": "建设路", "id": "51010807" }, { "name": "理工大", "id": "51010808" }, { "name": "龙潭寺", "id": "51010809" }, { "name": "李家沱", "id": "51010810" }, { "name": "猛追湾", "id": "51010811" }, { "name": "SM广场", "id": "51010812" }, { "name": "驷马桥", "id": "51010813" }, { "name": "五块石", "id": "51010814" }, { "name": "万年场", "id": "51010815" }, { "name": "万象城", "id": "51010816" }, { "name": "新华公园", "id": "51010817" }]
  }, {
    "id": "510106",
    "name": "金牛区",
    "list": [{
      "name": "不限",
      "id": "510106"
    }, { "name": "保利公园", "id": "51010601" }, { "name": "茶店子", "id": "51010602" }, { "name": "大丰", "id": "51010603" }, { "name": "动物园", "id": "51010604" }, { "name": "抚琴小区", "id": "51010605" }, { "name": "高家庄", "id": "51010606" }, { "name": "国宾", "id": "51010607" }, { "name": "花牌坊", "id": "51010608" }, { "name": "花照壁", "id": "51010609" }, { "name": "华侨城", "id": "51010610" }, { "name": "九里堤", "id": "51010611" }, { "name": "金牛万达", "id": "51010612" }, { "name": "金府", "id": "51010613" }, { "name": "马鞍路", "id": "51010614" }, { "name": "沙湾", "id": "51010615" }, { "name": "石人小区", "id": "51010616" }, { "name": "蜀汉路", "id": "51010617" }, { "name": "通惠门", "id": "51010618" }, { "name": "天回镇", "id": "51010619" }, { "name": "五块石", "id": "51010620" }, { "name": "新都城区", "id": "51010621" }, { "name": "犀浦", "id": "51010622" }, { "name": "西南交大", "id": "51010623" }, { "name": "营门口", "id": "51010624" }, { "name": "一品天下", "id": "51010625" }]
    }, {
      "id": "510126",
      "name": "天府新区",
      "list": [{
        "name": "不限",
        "id": "510126"
      }, { "name": "海洋公园", "region": "51012601" }, { "name": "华阳", "region": "51012602" }, { "name": "锦江生态带", "region": "51012603" }, { "name": "麓山", "region": "51012604" }, { "name": "麓湖生态城", "region": "51012605" }, { "name": "南湖", "region": "51012606" }, { "name": "四河", "region": "51012607" }, { "name": "雅居乐", "region": "51012608" }]
  }, {
      "id": "510127",
    "name": "高新西",
    "list": [{
      "name": "不限",
      "id": "510127"
    }, {
        "name": "高新西",
        "id": "51012701"
    }, {
      "name": "中海国际",
      "id": "51012702"
    }]
  }, {
      "id": "510116",
      "name": "双流",
      "list": [{
        "name": "不限",
        "id": "510116"
      }, { "name": "草金立交", "region": "51011601" }, { "name": "东升镇", "region": "51011602" }, { "name": "公兴", "region": "51011603" }, { "name": "航空港", "region": "51011604" }, { "name": "华府", "region": "51011605" }, { "name": "蛟龙港", "region": "51011606" }, { "name": "警院", "region": "51011607" }, { "name": "九龙湖", "region": "51011608" }, { "name": "牧马山", "region": "51011609" }, { "name": "南湖", "region": "51011610" }, { "name": "双流城区", "region": "51011611" }, { "name": "万家湾", "region": "51011612" }, { "name": "文星镇", "region": "51011613" }, { "name": "新津", "region": "51011614" }]
  }, {
    "id": "510115",
    "name": "温江",
    "list": [{
      "name": "不限",
      "id": "510115"
    }, { "name": "都江堰", "region": "51011501" }, { "name": "芙蓉古城", "region": "51011502" }, { "name": "国色天香", "region": "51011503" }, { "name": "光华大道沿线", "region": "51011504" }, { "name": "花都大道", "region": "51011505" }, { "name": "蛟龙港", "region": "51011506" }, { "name": "温江大学城", "region": "51011507" }, { "name": "温江老城", "region": "51011508" }, { "name": "温江新城", "region": "51011509" }, { "name": "珠江新城", "region": "51011510" }]
    }, {
      "id": "510117",
      "name": "郫都",
      "list": [{
        "name": "不限",
        "id": "510117"
      }, { "name": "成外", "region": "51011701" }, { "name": "都江堰", "region": "51011702" }, { "name": "红光", "region": "51011703" }, { "name": "华侨城", "region": "51011704" }, { "name": "郫县万达", "region": "51011705" }, { "name": "郫县城区", "region": "51011706" }, { "name": "犀浦", "region": "51011707" }, { "name": "橡树湾", "region": "51011708" }]
  }, {
    "id": "510112",
    "name": "龙泉驿",
    "list": [{
      "name": "不限",
      "id": "510112"
    }, { "name": "大面", "region": "51011201" }, { "name": "东山", "region": "51011202" }, { "name": "洪河", "region": "51011203" }, { "name": "航天", "region": "51011204" }, { "name": "龙泉驿城区", "region": "51011205" }, { "name": "青白江", "region": "51011206" }, { "name": "十陵", "region": "51011207" }, { "name": "阳光城", "region": "51011208" }]
    }, {
      "id": "510114",
      "name": "新都",
      "list": [{
        "name": "不限",
        "id": "510114"
      }, { "name": "保利公园", "region": "51011401" }, { "name": "大丰", "region": "51011402" }, { "name": "动物园", "region": "51011403" }, { "name": "毗河", "region": "51011404" }, { "name": "青白江", "region": "51011405" }, { "name": "十陵", "region": "51011406" }, { "name": "新都城区", "region": "51011407" }, { "name": "犀浦", "region": "51011408" }]
    }]
}

function getCity(){
	return city_data;
}

module.exports = {
  getCity: getCity
}